---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementMulticlassFilter
source: html/e299ef73-413f-2484-caa4-9e98296e825d.htm
---
# ElementMulticlassFilter Members

Constructs a new instance of a filter to find elements whose Element subclasses matches any of a given set of input classes.